Revit 2027 API
ColumnAttachmentCutStyle Enumeration
 Control the handling of columns that intersect their targets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ColumnAttachmentCutStyle
Public Enumeration ColumnAttachmentCutStyle
public enum class ColumnAttachmentCutStyle
type ColumnAttachmentCutStyle
Members
Member name | Value | Description
CutColumn | 0
CutTarget | 1
None | 2
See Also
Reference
Autodesk.Revit.DB Namespace